In [1]:
import pandas as pd
import numpy as np

In [2]:
# Series
ar = np.random.randn(5)
print(type(ar))
print(ar)
s1 = pd.Series(ar, index=['a', 'b', 'c', 'd', 'e']) # mit Index
print(type(s1))
s2 = pd.Series(ar) # ohne Index
print(s1)
print(s2)

<class 'numpy.ndarray'>
[-2.77670889  0.10508729 -0.45914649 -2.09694387 -0.02665732]
<class 'pandas.core.series.Series'>
a   -2.776709
b    0.105087
c   -0.459146
d   -2.096944
e   -0.026657
dtype: float64
0   -2.776709
1    0.105087
2   -0.459146
3   -2.096944
4   -0.026657
dtype: float64

In [3]:
# mit dictionary
d = {'a' : 0., 'b' : 1., 'c' : 2.}
print(pd.Series(d)) 
print(pd.Series(d, index=['b', 'c', 'd', 'a']))
print(pd.Series(5., index=['a', 'b', 'c', 'd', 'e']))

a    0.0
b    1.0
c    2.0
dtype: float64
b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64
a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [4]:
print(s1)
print(s2)

a   -2.776709
b    0.105087
c   -0.459146
d   -2.096944
e   -0.026657
dtype: float64
0   -2.776709
1    0.105087
2   -0.459146
3   -2.096944
4   -0.026657
dtype: float64

In [5]:
#slicing will also slice the index.
s1[1:3]
s2[1:3]

1    0.105087
2   -0.459146
dtype: float64

In [6]:
print(s1['a'])
try:
    print("s2['a']",s2['a'])
except KeyError                                  :
    print("s2[0]",s2[0])

-2.776708892396739
s2[0] -2.776708892396739

In [7]:
print(s1)
print(s1+s1)
print(s1*s1)
print(3*s1)
print(s1< s1.median())
print(s1[s1< s1.median()])

a   -2.776709
b    0.105087
c   -0.459146
d   -2.096944
e   -0.026657
dtype: float64
a   -5.553418
b    0.210175
c   -0.918293
d   -4.193888
e   -0.053315
dtype: float64
a    7.710112
b    0.011043
c    0.210815
d    4.397174
e    0.000711
dtype: float64
a   -8.330127
b    0.315262
c   -1.377439
d   -6.290832
e   -0.079972
dtype: float64
a     True
b    False
c    False
d     True
e    False
dtype: bool
a   -2.776709
d   -2.096944
dtype: float64

In [8]:
# DataFrame

d = {'one' : pd.Series([1., 'a', 3., 4], index=['a', 'b', 'c', 'e']), 
     'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [9]:
pd.DataFrame(d)

   one  two
a    1  1.0
b    a  2.0
c    3  3.0
d  NaN  4.0
e    4  NaN

In [10]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b    a  2.0
a    1  1.0

In [11]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [12]:
d = {'one' : [1., 2., 3., 4.], 'two' : [4., 3., 2., 1.]} # dictionary mit Listen ohne Index
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [13]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [14]:
pd.DataFrame([{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]) # jeder dict-Eintrag-->eine Zeile

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [15]:
d = {'one' : [1., 2., 3., 4.], 'two' : [4., 3., 2., 1.]} 
df  = pd.DataFrame(d, index=['a', 'b', 'c', 'd'])
df

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [16]:
df[1:2]

   one  two
b  2.0  3.0

In [17]:
df['one']

a    1.0
b    2.0
c    3.0
d    4.0
Name: one, dtype: float64

In [18]:
df['one']['c']

3.0

In [19]:
df['three'] = df['one'] * df['two']
df['flag'] = df['one'] > 2
df['test'] = pd.Series([1., 'a', 3., 4], index=['r', 'a', 'd', 'h'])
df

   one  two  three   flag test
a  1.0  4.0    4.0  False    a
b  2.0  3.0    6.0  False  NaN
c  3.0  2.0    6.0   True  NaN
d  4.0  1.0    4.0   True    3

In [20]:
df.assign(t = df['one'] / df['two'])

   one  two  three   flag test         t
a  1.0  4.0    4.0  False    a  0.250000
b  2.0  3.0    6.0  False  NaN  0.666667
c  3.0  2.0    6.0   True  NaN  1.500000
d  4.0  1.0    4.0   True    3  4.000000

The basics of indexing are as follows:

Operation | Syntax | Result 
----------| ------- |------
Select column | df[col] | Series
Select row by label | df.loc[label] | Series 
Select row by integer location | df.iloc[loc] | Series 
Slice rows | df[5:10] | DataFrame 
Select rows by boolean vector | df[bool_vec] | DataFrame

In [21]:
df.loc['b'] # Zeile b als Series

one          2
two          3
three        6
flag     False
test       NaN
Name: b, dtype: object

In [22]:
df.iloc[2] # Zeile mit Index 2 als Series

one         3
two         2
three       6
flag     True
test      NaN
Name: c, dtype: object

In [23]:
df[:5].T #transponiert exklusive t

           a      b     c     d
one        1      2     3     4
two        4      3     2     1
three      4      6     6     4
flag   False  False  True  True
test       a    NaN   NaN     3

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 5 columns):
one      4 non-null float64
two      4 non-null float64
three    4 non-null float64
flag     4 non-null bool
test     2 non-null object
dtypes: bool(1), float64(3), object(1)
memory usage: 324.0+ bytes

In [25]:
print(df)
#df.loc['a':'b']
df.loc['a':'b','one':'three']
#df[['one','flag']]

   one  two  three   flag test
a  1.0  4.0    4.0  False    a
b  2.0  3.0    6.0  False  NaN
c  3.0  2.0    6.0   True  NaN
d  4.0  1.0    4.0   True    3

   one  two  three
a  1.0  4.0    4.0
b  2.0  3.0    6.0

In [26]:
df.loc['a':'b','one':'three'].T.dot(df.loc['a':'b','one':'three']) # matrix-multiplikation

        one   two  three
one     5.0  10.0   16.0
two    10.0  25.0   34.0
three  16.0  34.0   52.0

In [27]:
df

   one  two  three   flag test
a  1.0  4.0    4.0  False    a
b  2.0  3.0    6.0  False  NaN
c  3.0  2.0    6.0   True  NaN
d  4.0  1.0    4.0   True    3

In [28]:
df.head(2)

   one  two  three   flag test
a  1.0  4.0    4.0  False    a
b  2.0  3.0    6.0  False  NaN

In [29]:
df.tail(3)

   one  two  three   flag test
b  2.0  3.0    6.0  False  NaN
c  3.0  2.0    6.0   True  NaN
d  4.0  1.0    4.0   True    3

In [30]:
df.shape

(4, 5)

In [31]:
df.columns # kann man auch Ã¼berschreiben

Index(['one', 'two', 'three', 'flag', 'test'], dtype='object')

In [32]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [33]:
df2=df.loc['a':'b','one':'three'].T.dot(df.loc['a':'b','one':'three'])
df2

        one   two  three
one     5.0  10.0   16.0
two    10.0  25.0   34.0
three  16.0  34.0   52.0

In [34]:
row = df2.iloc[1]
df2.sub(row, axis='columns')

       one   two  three
one   -5.0 -15.0  -18.0
two    0.0   0.0    0.0
three  6.0   9.0   18.0

In [35]:
col = df2['two']
df2.sub(col, axis='index')

        one  two  three
one    -5.0  0.0    6.0
two   -15.0  0.0    9.0
three -18.0  0.0   18.0

In [36]:
df2

        one   two  three
one     5.0  10.0   16.0
two    10.0  25.0   34.0
three  16.0  34.0   52.0

In [37]:
df2.dot([1,1,1]) # matrix vector mult

one       31.0
two       69.0
three    102.0
dtype: float64